miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2017 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_usb_hmsc_driver.c
 * Description  : USB Host MSC BOT driver
 ***********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 1.31.2018 1.00 First Release
 ***********************************************************************************************************************/

/******************************************************************************
 Includes   <System Includes> , "Project Includes"
 ******************************************************************************/

#include "r_usb_basic_if.h"
#include "r_usb_typedef.h"
#include "r_usb_hmsc_if.h"
#include "r_usb_extern.h"
#include "r_usb_hmsc.h"
#include "r_usb_bitdefine.h"
#include "r_usb_reg_access.h"

/******************************************************************************
 Private global variables and functions
 ******************************************************************************/

/* functions */
#if (BSP_CFG_RTOS_USED)
static uint16_t usb_hmsc_data_act (usb_utr_t *mess);
static uint16_t usb_hmsc_get_string_desc (usb_utr_t *ptr, uint16_t addr, uint16_t string, usb_cb_t complete);
static uint16_t usb_hmsc_send_cbw (usb_utr_t *ptr, uint16_t side);
static uint16_t usb_hmsc_send_data (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t size);
static uint16_t usb_hmsc_get_data (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t size);
static uint16_t usb_hmsc_get_csw (usb_utr_t *ptr, uint16_t side);
static usb_er_t usb_hmsc_clear_stall (usb_utr_t *ptr, uint16_t Pipe, usb_cb_t complete);
#else /* (BSP_CFG_RTOS_USED) */
static uint16_t usb_hmsc_data_act (usb_utr_t *mess);
static void usb_hmsc_stall_err (usb_utr_t *mess);
static void usb_hmsc_specified_path (usb_utr_t *mess);
static void usb_hmsc_check_result (usb_utr_t *mess, uint16_t data1, uint16_t data2);
static void usb_hmsc_command_result (usb_utr_t *ptr, uint16_t result);
static uint16_t usb_hmsc_get_string_desc (usb_utr_t *ptr, uint16_t addr, uint16_t string, usb_cb_t complete);
static uint16_t usb_hmsc_send_cbw (usb_utr_t *ptr, uint16_t side);
static uint16_t usb_hmsc_send_cbw_check (usb_utr_t *ptr, uint16_t side, uint16_t hmsc_retval);
static uint16_t usb_hmsc_send_data (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t size);
static uint16_t usb_hmsc_send_data_check (usb_utr_t *ptr, uint16_t side, uint16_t hmsc_retval);
static uint16_t usb_hmsc_get_data (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t size);
static uint16_t usb_hmsc_get_data_check (usb_utr_t *ptr, uint16_t side, uint16_t hmsc_retval);
static uint16_t usb_hmsc_get_csw (usb_utr_t *ptr, uint16_t side);
static uint16_t usb_hmsc_get_csw_check (usb_utr_t *ptr, uint16_t side, uint16_t hmsc_retval);
static usb_er_t usb_hmsc_clear_stall (usb_utr_t *ptr, uint16_t Pipe, usb_cb_t complete);
static uint16_t usb_hmsc_std_req_check (uint16_t result);

static void usb_hmsc_class_check_result (usb_utr_t *mess, uint16_t data1, uint16_t data2);
static void usb_hmsc_enumeration (usb_utr_t *mess);
#endif /* (BSP_CFG_RTOS_USED) */
static void usb_hmsc_configured (usb_utr_t *ptr, uint16_t addr, uint16_t data2);
static void usb_hmsc_detach (usb_utr_t *ptr, uint16_t addr, uint16_t data2);

/* variables */
static usb_utr_t usb_hmsc_trans_data[USB_NUM_USBIP][USB_MAXSTRAGE]; /* Send data transfer message */
static usb_utr_t usb_hmsc_receive_data[USB_NUM_USBIP][USB_MAXSTRAGE]; /* Receive data transfer message */
static uint32_t usb_hmsc_trans_size[USB_NUM_USBIP];
static uint8_t *pusb_hmsc_buff[USB_NUM_USBIP];
static uint16_t usb_shmsc_process[USB_NUM_USBIP];
#if (BSP_CFG_RTOS_USED == 0)
static uint16_t usb_shmsc_data_seq[USB_NUM_USBIP];
static uint16_t usb_shmsc_stall_err_seq[USB_NUM_USBIP];
static uint16_t usb_hmsc_csw_err_loop[USB_NUM_USBIP];
#endif /* (BSP_CFG_RTOS_USED == 0) */

#if (BSP_CFG_RTOS_USED)
static uint16_t usb_hmsc_csw_err_stall[USB_NUM_USBIP];
#endif /* (BSP_CFG_RTOS_USED) */

uint32_t    g_usb_hmsc_cmd_data_length[USB_NUM_USBIP];

/******************************************************************************
 Exported global variables
 ******************************************************************************/
#if (BSP_CFG_RTOS_USED == 1)
extern SemaphoreHandle_t    SemaphoreHandleRead;
#endif /*BSP_CFG_RTOS_USED == 1 */

