miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_set_rw_cbw
 Description     : CBW parameter initialization for the READ10/WRITE10 command
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     command     : ATAPI command
                 : uint32_t     secno       : Sector number
                 : uint16_t     seccnt      : Sector count
                 : uint32_t     trans_byte  : Transfer size
                 : uint16_t     side        : Driver number
 Return value    : none
 ******************************************************************************/
void usb_hmsc_set_rw_cbw (usb_utr_t *ptr, uint16_t command, uint32_t secno, uint16_t seccnt, uint32_t trans_byte,
        uint16_t side)
{
    /* CBW parameter set */
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_tag = g_usb_hmsc_csw_tag_no[ptr->ip][side];
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_lo = (uint8_t) trans_byte;
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_ml = (uint8_t) (trans_byte >> 8);
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_mh = (uint8_t) (trans_byte >> 16);
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_hi = (uint8_t) (trans_byte >> 24);
    g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.cbw_dir = 0;
    g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.reserved7 = 0;
    g_usb_hmsc_cbw[ptr->ip][side].bcbw_lun.bcbw_lun = 0; /*** Support LUN0 ONLY ***/
    g_usb_hmsc_cbw[ptr->ip][side].bcbw_lun.reserved4 = 0;
    g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 0;
    g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.reserved3 = 0;

    /* ATAPI_COMMAND */
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[0] = (uint8_t) command;

    /* LUN */
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[1] = 0x00;

    /* sector address */
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[2] = (uint8_t) (secno >> 24);
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[3] = (uint8_t) (secno >> 16);
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[4] = (uint8_t) (secno >> 8);
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[5] = (uint8_t) secno;

    /* Reserved */
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[6] = 0x00;

    /* Sector length */
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[7] = (uint8_t) (seccnt >> 8);

    /* Block address */
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[8] = (uint8_t) seccnt;

    /* Control data */
    g_usb_hmsc_cbw[ptr->ip][side].cbwcb[9] = (uint8_t) 0x00;

    /* ATAPI command check */
    switch (command)
    {
        case USB_ATAPI_TEST_UNIT_READY :
        case USB_ATAPI_REQUEST_SENSE :
        case USB_ATAPI_INQUIRY :
        case USB_ATAPI_MODE_SELECT6 :
        case USB_ATAPI_MODE_SENSE6 :
        case USB_ATAPI_START_STOP_UNIT :
        case USB_ATAPI_PREVENT_ALLOW :
        case USB_ATAPI_READ_FORMAT_CAPACITY :
        case USB_ATAPI_READ_CAPACITY :
            USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;

            /* Initialized READ CBW TAG */
        case USB_ATAPI_READ10 :
            g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.cbw_dir = 1;

            /* 10bytes */
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 10;
        break;

            /* Initialized WRITE CBW TAG */
        case USB_ATAPI_WRITE10 :
            g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.cbw_dir = 0;

            /* 10bytes */
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 10;
        break;
        case USB_ATAPI_SEEK :
        case USB_ATAPI_WRITE_AND_VERIFY :
        case USB_ATAPI_VERIFY10 :
        case USB_ATAPI_MODE_SELECT10 :
        case USB_ATAPI_MODE_SENSE10 :
        default :
            USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
    }

    if (USB_ATAPI == g_usb_hmsc_sub_class[ptr->ip][side])
    {
        /* 12bytes */
        g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = USB_MSC_CBWCB_LENGTH;
    }
}
/******************************************************************************
 End of function usb_hmsc_set_rw_cbw
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_set_els_cbw
 Description     : CBW parameter initialization for other commands
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint8_t      *cbwcb      : Pointer to the CBW area
                 : uint32_t     trans_byte  : Transfer size
                 : uint16_t     side        : Drive number
 Return value    : none
 ******************************************************************************/
void usb_hmsc_set_els_cbw (usb_utr_t *ptr, uint8_t *cbwcb, uint32_t trans_byte, uint16_t side)
{
    uint8_t i;

    /* CBW parameter set */
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_tag = g_usb_hmsc_csw_tag_no[ptr->ip][side];
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_lo = (uint8_t) trans_byte;
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_ml = (uint8_t) (trans_byte >> 8);
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_mh = (uint8_t) (trans_byte >> 16);
    g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_hi = (uint8_t) (trans_byte >> 24);

    /* Receive */
    g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.cbw_dir = 0;
    g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.reserved7 = 0;
    g_usb_hmsc_cbw[ptr->ip][side].bcbw_lun.bcbw_lun = 0; /*** Support LUN0 ONLY ***/
    g_usb_hmsc_cbw[ptr->ip][side].bcbw_lun.reserved4 = 0;
    g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.reserved3 = 0;

    for (i = 0; i < 12; i++)
    {
        g_usb_hmsc_cbw[ptr->ip][side].cbwcb[i] = cbwcb[i];
    }

    /* ATAPI command check */
    switch (cbwcb[0])
    {
        /* No data */
        case USB_ATAPI_TEST_UNIT_READY :
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 6;
        break;

            /* Receive */
        case USB_ATAPI_REQUEST_SENSE :
            g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.cbw_dir = 1;
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 6;
        break;

            /* Send */
        case USB_ATAPI_FORMAT_UNIT :
            USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;

            /* Receive */
        case USB_ATAPI_INQUIRY :
            g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.cbw_dir = 1;
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 6;
        break;
        case USB_ATAPI_MODE_SELECT6 :
        case USB_ATAPI_MODE_SENSE6 :
        break;

            /* No data */
        case USB_ATAPI_START_STOP_UNIT :
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 6;
        break;

            /* No data */
        case USB_ATAPI_PREVENT_ALLOW :
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 6;
        break;

            /* Receive */
        case USB_ATAPI_READ_FORMAT_CAPACITY :
            g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.cbw_dir = 1;
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 10;
        break;

            /* Receive */
        case USB_ATAPI_READ_CAPACITY :
            g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.cbw_dir = 1;
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 10;
        break;
        case USB_ATAPI_READ10 :
        case USB_ATAPI_WRITE10 :
            USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
        case USB_ATAPI_SEEK :
        case USB_ATAPI_WRITE_AND_VERIFY :
        case USB_ATAPI_VERIFY10 :
            USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;

            /* Send */
        case USB_ATAPI_MODE_SELECT10 :
            USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;

            /* Receive */
        case USB_ATAPI_MODE_SENSE10 :
            g_usb_hmsc_cbw[ptr->ip][side].bm_cbw_flags.cbw_dir = 1;
            g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = 10;
        break;
        default :
            USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
    }

