miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
                /* Clear STALL for IN pipe */
                usb_hmsc_clear_stall(mess, g_usb_hmsc_in_pipe[mess->ip][side], class_trans_result);
                g_usb_hmsc_in_pipectr[mess->ip][side] = 0;
            break;
            case USB_HMSC_SUBMIT_ERR:
                USB_PRINTF1("### Data : GetCSW error(drive:%d) \n", side);
            break;
            default:
            break;
        }
    }

    return (hmsc_retval);
#else /* (BSP_CFG_RTOS_USED) */
    static uint16_t side;
    uint16_t hmsc_retval;
    uint16_t result;
    uint8_t *pbuff;
    uint32_t size;

    pbuff = pusb_hmsc_buff[mess->ip];
    size = usb_hmsc_trans_size[mess->ip];
    result = mess->result;

    switch (usb_shmsc_data_seq[mess->ip])
    {
        case USB_SEQ_0 : /* CBW */
            side = mess->keyword;
            hmsc_retval = usb_hmsc_send_cbw(mess, side);
            usb_shmsc_data_seq[mess->ip]++;
        break;

        case USB_SEQ_1 : /* Check CBW and Send Data */
            hmsc_retval = usb_hmsc_send_cbw_check(mess, side, result);
            if (USB_HMSC_STALL == hmsc_retval)
            {
                usb_shmsc_process[mess->ip] = USB_MSG_HMSC_CBW_ERR;
                usb_shmsc_stall_err_seq[mess->ip] = USB_SEQ_0;
                mess->keyword = g_usb_hmsc_drvno_tbl[side].devadr;
                usb_hmsc_specified_path((usb_utr_t *) mess);
                usb_shmsc_data_seq[mess->ip] = USB_SEQ_0;
            }
            else if (hmsc_retval != USB_HMSC_OK)
            {
                USB_PRINTF1("### Data : SendCBW error(drive:%d) \n", side);
                usb_shmsc_data_seq[mess->ip] = USB_SEQ_0;
                usb_hmsc_command_result(mess, hmsc_retval);
            }

            else /* Success */
            {
                switch (usb_shmsc_process[mess->ip])
                {
                    case USB_MSG_HMSC_NO_DATA :
                        hmsc_retval = usb_hmsc_get_csw(mess, side);
                        usb_shmsc_data_seq[mess->ip] = USB_SEQ_4;
                    break;
                    case USB_MSG_HMSC_DATA_OUT :
                        hmsc_retval = usb_hmsc_send_data(mess, side, pbuff, size);
                        usb_shmsc_data_seq[mess->ip]++;
                    break;
                    case USB_MSG_HMSC_DATA_IN :
                        g_usb_hmsc_cmd_data_length[mess->ip] = 0;
                        hmsc_retval = usb_hmsc_get_data(mess, side, pbuff, size);
                        usb_shmsc_data_seq[mess->ip]++;
                    break;
                    default :
                    break;
                }
            }
        break;

        case USB_SEQ_2 : /* Check Data and Send CSW*/
            if ( USB_MSG_HMSC_DATA_OUT == usb_shmsc_process[mess->ip])
            {
                hmsc_retval = usb_hmsc_send_data_check(mess, side, result);
                if (hmsc_retval == USB_HMSC_STALL)
                {
                    usb_hmsc_clear_stall(mess, g_usb_hmsc_out_pipe[mess->ip][side], usb_hmsc_check_result);
                    usb_shmsc_data_seq[mess->ip]++;
                }
                else if (hmsc_retval != USB_HMSC_OK)
                {
                    USB_PRINTF1("### Data : SendData error(drive:%d) \n", side);
                    usb_hmsc_command_result(mess, hmsc_retval);
                    usb_shmsc_data_seq[mess->ip] = USB_SEQ_0;
                }
                else /* Success */
                {
                    hmsc_retval = usb_hmsc_get_csw(mess, side);
                    usb_shmsc_data_seq[mess->ip] = USB_SEQ_4;
                }
            }
            else if ( USB_MSG_HMSC_DATA_IN == usb_shmsc_process[mess->ip])
            {
                hmsc_retval = usb_hmsc_get_data_check(mess, side, result);
                if (hmsc_retval == USB_HMSC_STALL)
                {
                    usb_hmsc_clear_stall(mess, g_usb_hmsc_in_pipe[mess->ip][side], usb_hmsc_check_result);
                    usb_shmsc_data_seq[mess->ip]++;
                }
                else if (hmsc_retval != USB_HMSC_OK)
                {
                    USB_PRINTF1("### Data : SendData error(drive:%d) \n", side);
                    usb_hmsc_command_result(mess, hmsc_retval);
                    usb_shmsc_data_seq[mess->ip] = USB_SEQ_0;
                }
                else /* Success */
                {
                    g_usb_hmsc_cmd_data_length[mess->ip] = mess->tranlen;
                    hmsc_retval = usb_hmsc_get_csw(mess, side);
                    usb_shmsc_data_seq[mess->ip] = USB_SEQ_4;
                }
            }
            else
            {
                /* Non */
            }

        break;

        case USB_SEQ_3 : /* Check ClearStall and Send CSW */
            usb_hmsc_std_req_check(result);
            hmsc_retval = usb_hmsc_get_csw(mess, side);
            usb_shmsc_data_seq[mess->ip]++;
        break;

        case USB_SEQ_4 : /* Check CSW */
            usb_shmsc_data_seq[mess->ip] = USB_SEQ_0;
            hmsc_retval = usb_hmsc_get_csw_check(mess, side, result);
            switch (hmsc_retval)
            {
                case USB_HMSC_OK : /* Success */
                    if (usb_hmsc_csw_err_loop[mess->ip] == USB_ON)
                    {
                        usb_hmsc_csw_err_loop[mess->ip] = USB_OFF;
                        hmsc_retval = USB_HMSC_CSW_ERR;
                    }
                    usb_hmsc_command_result(mess, hmsc_retval);
                break;

                case USB_HMSC_CSW_ERR :
                    USB_PRINTF1("*** Data : CSW-NG(drive:%d) \n", side);

                    if (USB_MSG_HMSC_STRG_USER_COMMAND != g_usb_hmsc_strg_process[mess->ip])
                    {
                        usb_hmsc_csw_err_loop[mess->ip] = USB_ON;
                        usb_hmsc_request_sense(mess, side, pbuff);
                    }
                    else
                    {
                        if (usb_hmsc_csw_err_loop[mess->ip] == USB_ON)
                        {
                            usb_hmsc_csw_err_loop[mess->ip] = USB_OFF;
                        }
                        usb_hmsc_command_result(mess, hmsc_retval);
                    }
                break;

                case USB_HMSC_STALL :
                    USB_PRINTF1("*** Data : CSW-STALL(drive:%d) \n", side);
                    g_usb_hmsc_in_pipectr[mess->ip][side] = 0;
                    usb_hmsc_clear_stall(mess, g_usb_hmsc_in_pipe[mess->ip][side], usb_hmsc_check_result);
                    usb_shmsc_data_seq[mess->ip] = USB_SEQ_3;
                break;

                case USB_HMSC_CSW_PHASE_ERR :
                    USB_PRINTF1("*** Data : CSW-PhaseError(drive:%d) \n", side);
                    usb_shmsc_process[mess->ip] = USB_MSG_HMSC_CSW_PHASE_ERR;
                    usb_shmsc_stall_err_seq[mess->ip] = USB_SEQ_0;
                    mess->keyword = g_usb_hmsc_drvno_tbl[side].devadr;
                    usb_hmsc_specified_path((usb_utr_t *) mess);
                break;

                default :
                    /* Non */
                break;
            }

        break;

        default :
            while (1)
            {
                /* Non */
            }
        break;
    }

    /* Data read error */
    return (hmsc_retval);
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_data_act
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_stall_err
 Description     : HMSC Stall Error
 Arguments       : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_stall_err (usb_utr_t *mess)
{
    static uint16_t devadr;
    uint16_t side;
    uint16_t result;
    usb_er_t err;

    result = mess->status;

    switch (usb_shmsc_stall_err_seq[mess->ip])
    {
        case USB_SEQ_0 :
            devadr = mess->keyword;
            err = usb_hmsc_mass_storage_reset(mess, devadr, (usb_cb_t) usb_hmsc_check_result);

            /* Control Transfer overlaps */
            if (USB_QOVR == err)
            {
                usb_hmsc_message_retry( USB_HMSC_MBX, mess);
            }
            else
            {
                /* Control Transfer not overlaps */
                usb_shmsc_stall_err_seq[mess->ip]++;
            }
        break;

        case USB_SEQ_1 :
            usb_hmsc_std_req_check(result);
            if ( USB_IP1 == mess->ip)
            {
                devadr |= USBA_ADDRESS_OFFSET;
            }
            side = usb_hmsc_ref_drvno(devadr);

            if (USB_ERROR == side)
            {
                usb_hmsc_command_result(mess, USB_HMSC_CBW_ERR);
                usb_shmsc_stall_err_seq[mess->ip] = USB_SEQ_0;
                return;
            }

            usb_hmsc_clear_stall(mess, g_usb_hmsc_out_pipe[mess->ip][side], usb_hmsc_check_result);
            usb_shmsc_stall_err_seq[mess->ip]++;
            g_usb_hmsc_out_pipectr[mess->ip][side] = 0;
        break;

        case USB_SEQ_2 :
            if ( USB_IP1 == mess->ip)
            {
                devadr |= USBA_ADDRESS_OFFSET;
            }
            side = usb_hmsc_ref_drvno(devadr);

            if (USB_ERROR == side)
            {
                usb_hmsc_command_result(mess, USB_HMSC_CBW_ERR);
                usb_shmsc_stall_err_seq[mess->ip] = USB_SEQ_0;
                return;
            }

            usb_hmsc_clear_stall(mess, g_usb_hmsc_in_pipe[mess->ip][side], usb_hmsc_check_result);
            usb_shmsc_stall_err_seq[mess->ip]++;
            g_usb_hmsc_in_pipectr[mess->ip][side] = 0;
        break;

        case USB_SEQ_3 :
            if (USB_MSG_HMSC_CSW_PHASE_ERR == mess->msginfo)
            {
                result = USB_HMSC_CSW_PHASE_ERR;
            }
            else
            {
                result = USB_HMSC_CBW_ERR;
            }
            usb_hmsc_command_result(mess, result);
            usb_shmsc_stall_err_seq[mess->ip] = USB_SEQ_0;
        break;

        default :
            if (USB_MSG_HMSC_CSW_PHASE_ERR == mess->msginfo)
            {
                result = USB_HMSC_CSW_PHASE_ERR;
            }
            else
            {
                result = USB_HMSC_CBW_ERR;
            }
            usb_hmsc_command_result(mess, result);
            usb_shmsc_stall_err_seq[mess->ip] = USB_SEQ_0;
        break;
    }
}
/******************************************************************************
 End of function usb_hmsc_stall_err
 ******************************************************************************/

