miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_specified_path
 Description     : Next Process Selector
 Arguments       : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_specified_path (usb_utr_t *mess)
{
    usb_utr_t *pblf;
    usb_er_t err;

    /* Get mem pool blk */
    if ( USB_PGET_BLK(USB_HMSC_MPL, &pblf) == USB_OK)
    {
        pblf->msginfo = usb_shmsc_process[mess->ip];
        pblf->keyword = mess->keyword;
        pblf->result = mess->result;
        pblf->ip = mess->ip;
        pblf->ipp = mess->ipp;
        pblf->tranlen = mess->tranlen;

        /* Send message */
        err = USB_SND_MSG(USB_HMSC_MBX, (usb_msg_t* )pblf);
        if (USB_OK != err)
        {
            err = USB_REL_BLK(USB_HMSC_MPL, (usb_mh_t )pblf);
            USB_PRINTF0("### SpecifiedPass function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### SpecifiedPass function pget_blk error\n");
    }
}
/******************************************************************************
 End of function usb_hmsc_specified_path
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_check_result
 Description     : Hub class check result
 Arguments       : usb_utr_t    *mess   : Pointer to usb_utr_t structure
                 : uint16_t     data1   : Not used
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_check_result (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    mess->result = mess->status;
    usb_hmsc_specified_path(mess);
}
/******************************************************************************
 End of function usb_hmsc_check_result
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_command_result
 Description     : Hub class check result
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     result  : Command Result
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_command_result (usb_utr_t *ptr, uint16_t result)
{
    usb_utr_t *pblf;
    usb_er_t err;

    /* Get mem pool blk */
    if ( USB_PGET_BLK(USB_HSTRG_MPL,&pblf) == USB_OK)
    {
        pblf->msginfo = g_usb_hmsc_strg_process[ptr->ip];
        pblf->result = result;
        pblf->ip = ptr->ip;
        pblf->ipp = ptr->ipp;
        pblf->tranlen = ptr->tranlen;

        /* Send message */
        err = USB_SND_MSG(USB_HSTRG_MBX, (usb_msg_t* )pblf);
        if (USB_OK != err)
        {
            err = USB_REL_BLK(USB_HSTRG_MPL, (usb_mh_t )pblf);
            USB_PRINTF0("### CheckResult function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### CheckResult function pget_blk error\n");
    }
}
/******************************************************************************
 End of function usb_hmsc_command_result
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

/******************************************************************************
 Function Name   : usb_hmsc_get_string_desc
 Description     : Set GetDescriptor
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     addr        : Device address
                 : uint16_t     string      : String Descriptor index
                 : usb_cb_t     complete    : callback function
 Return value    : uint16_t                 : error info
 ******************************************************************************/
static uint16_t usb_hmsc_get_string_desc (usb_utr_t *ptr, uint16_t addr, uint16_t string, usb_cb_t complete)
{
    uint16_t i;
    static usb_ctrl_trans_t string_setup[USB_NUM_USBIP];
#if (BSP_CFG_RTOS_USED)
    usb_er_t err;
    uint16_t hmsc_retval;
#endif /* (BSP_CFG_RTOS_USED) */

    if (0 == string)
    {
        string_setup[ptr->ip].setup.index = (uint16_t) 0x0000;
        string_setup[ptr->ip].setup.length = (uint16_t) 0x0004;
    }
    else
    {
        /* Set LanguageID */
        string_setup[ptr->ip].setup.index = (uint16_t) (g_usb_hmsc_class_data[ptr->ip][2]);
        string_setup[ptr->ip].setup.index |= (uint16_t) ((uint16_t) (g_usb_hmsc_class_data[ptr->ip][3]) << 8);
        string_setup[ptr->ip].setup.length = (uint16_t) USB_HMSC_CLSDATASIZE;
    }
    string_setup[ptr->ip].setup.type = USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_STANDARD | USB_DEVICE;
    string_setup[ptr->ip].setup.value = (uint16_t) (USB_STRING_DESCRIPTOR + string);
    string_setup[ptr->ip].address = addr;

    for (i = 0; i < string_setup[ptr->ip].setup.length; i++)
    {
        g_usb_hmsc_class_data[ptr->ip][i] = (uint8_t) 0xFF;
    }

    g_usb_hmsc_class_control[ptr->ip].p_tranadr = (void *) g_usb_hmsc_class_data[ptr->ip];
    g_usb_hmsc_class_control[ptr->ip].complete = complete;
    g_usb_hmsc_class_control[ptr->ip].tranlen = (uint32_t) string_setup[ptr->ip].setup.length;
    g_usb_hmsc_class_control[ptr->ip].keyword = USB_PIPE0;
    g_usb_hmsc_class_control[ptr->ip].p_setup = (uint16_t *) &string_setup[ptr->ip];
    g_usb_hmsc_class_control[ptr->ip].segment = USB_TRAN_END;

    g_usb_hmsc_class_control[ptr->ip].ip = ptr->ip;
    g_usb_hmsc_class_control[ptr->ip].ipp = ptr->ipp;

#if (BSP_CFG_RTOS_USED)
    err = usb_hstd_transfer_start_req(&g_usb_hmsc_class_control[ptr->ip]);
    if (USB_OK == err)
    {
        hmsc_retval = usb_hmsc_req_trans_wait_tmo((uint16_t)3000);
        if (USB_DATA_STALL == hmsc_retval)
        {
            USB_PRINTF0("*** GetStringDesc STALL !\n");
            return USB_ERROR;
        }
        else if (USB_DATA_TMO == hmsc_retval)
        {
            USB_PRINTF0("*** GetStringDesc Timeout error !\n");
            return USB_ERROR;
        }
        else if (USB_CTRL_END != hmsc_retval)
        {
            USB_PRINTF0("*** GetStringDesc error !\n");
            return USB_ERROR;
        }
        else
        {
            return USB_OK;
        }
    }
    else
    {
        return USB_ERROR;
    }
#else /* (BSP_CFG_RTOS_USED) */
    return (usb_hstd_transfer_start_req(&g_usb_hmsc_class_control[ptr->ip]));
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_get_string_desc
 ******************************************************************************/

