miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
}
/******************************************************************************
 End of function usb_hmsc_configured
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_detach
 Description     : Callback function for MSC device detach
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     addr    : Device Address
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_detach (usb_utr_t *ptr, uint16_t addr, uint16_t data2)
{
#if (BSP_CFG_RTOS_USED == 0)
    uint16_t i;
    uint16_t j;
    uint16_t side;
    uint16_t que_cnt;
    usb_ctrl_t ctrl;
    uint16_t ipno_devaddr;

    /* Clear pipe table. */
    usb_hstd_clr_pipe_table (ptr->ip, addr);

    ipno_devaddr = addr;
    if ( USB_IP1 == ptr->ip)
    {
        ipno_devaddr |= USBA_ADDRESS_OFFSET;
    }

    if (g_drive_search_lock == ipno_devaddr)
    {
        g_drive_search_lock = USB_FALSE;
    }

    que_cnt = g_drive_search_que_cnt;
    for (i = 0; i < que_cnt; i++)
    {
        if (g_drive_search_que[i] == ipno_devaddr)
        {
            g_drive_search_que[i] = USB_FALSE;
            for (j = i; j < que_cnt; j++)
            {
                g_drive_search_que[j] = g_drive_search_que[j + 1];
            }
            g_drive_search_que_cnt--;
        }
    }

    side = usb_hmsc_ref_drvno(ipno_devaddr);
    if (USB_ERROR != side)
    {
        usb_hmsc_strg_drive_close(ptr, side); /* Callback when device is detached. */
    }

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = addr;
    usb_set_event(USB_STS_DETACH, &ctrl); /* Set Event()  */

#else   /* BSP_CFG_RTOS_USED == 0 */
    usb_ctrl_t  ctrl;
    uint16_t    side;
    uint16_t    ipno_devaddr;

    ipno_devaddr = addr;
    if (USB_IP1 == ptr->ip)
    {
        ipno_devaddr |= USBA_ADDRESS_OFFSET;
    }
    
    side = usb_hmsc_ref_drvno(ipno_devaddr);
    if (USB_ERROR != side)
    {
        usb_hmsc_strg_drive_close(ptr, side); /* Callback when device is detached. */
    }

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = addr;
    usb_set_event(USB_STS_DETACH, &ctrl); /* Set Event()  */
#endif  /* BSP_CFG_RTOS_USED == 0 */
}
/******************************************************************************
 End of function usb_hmsc_detach
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hmsc_drive_complete
 Description     : Next Process Selector
 Argument        : none
 Return          : none
 ******************************************************************************/
void usb_hmsc_drive_complete (usb_utr_t *ptr, uint16_t addr, uint16_t data2)
{
    usb_ctrl_t  ctrl;
#if (BSP_CFG_RTOS_USED == 0)
    uint16_t    que_cnt;
    uint16_t    i;

    que_cnt = g_drive_search_que_cnt;
    if (g_drive_search_que_cnt)
    {
        g_drive_search_que[0] = USB_NULL;
        for (i = 0; i < que_cnt; i++)
        {
            g_drive_search_que[i] = g_drive_search_que[i + 1];
        }
        g_drive_search_que_cnt--;
    }
    g_drive_search_lock = USB_FALSE;
#endif  /* BSP_CFG_RTOS_USED == 0 */

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = addr;

    usb_set_event(USB_STS_CONFIGURED, &ctrl); /* Set Event()  */
} /* End of function usb_hmsc_drive_complete() */

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_registration
 Description     : sample registration.
 Argument        : none
 Return          : none
 ******************************************************************************/
void usb_registration (usb_utr_t *ptr)
{
    usb_hmsc_registration(ptr);
} /* End of function usb_registration() */
#endif  /* BSP_CFG_RTOS_USED == 0 */

/******************************************************************************
 Function Name   : usb_hmsc_registration
 Description     : registration of Host msc driver.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void usb_hmsc_registration (usb_utr_t *ptr)
{
    usb_hcdreg_t driver;
    uint8_t i;

    /* Driver registration */
    driver.ifclass = (uint16_t) USB_IFCLS_MAS;          /* Use Interface class for MSC. */
    driver.p_tpl = (uint16_t*) &g_usb_hmsc_devicetpl;   /* Target peripheral list. */
    driver.classinit = &usb_hstd_dummy_function;        /* Driver init. */
    driver.classcheck = &usb_hmsc_class_check;          /* Driver check. */
    driver.devconfig = &usb_hmsc_configured;            /* Callback when device is configured. */
    driver.devdetach = &usb_hmsc_detach;                /* Callback when device is detached. */
    driver.devsuspend = &usb_hstd_dummy_function;       /* Callback when device is suspended. */
    driver.devresume = &usb_hstd_dummy_function;        /* Callback when device is resumed. */

    for (i = 0; i < USB_MAXSTRAGE; i++) /* Loop support HID device count */
    {
        usb_hstd_driver_registration(ptr, &driver); /* Host MSC class driver registration. */
    }
#if (BSP_CFG_RTOS_USED == 0)
    usb_cstd_set_task_pri(USB_HUB_TSK, USB_PRI_3); /* Hub Task Priority set */
#endif  /* BSP_CFG_RTOS_USED == 0 */

    usb_hhub_registration(ptr, (usb_hcdreg_t *) USB_NULL); /* Hub registration. */
}
/******************************************************************************
 End of function usb_hmsc_registration
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_message_retry
 Description     : Message transfer retry for Que Over
 Arguments       : uint16_t     id      : Message ID
                 : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
 usb_utr_t *mess
 Return value    : none
 ******************************************************************************/
void usb_hmsc_message_retry (uint16_t id, usb_utr_t *mess)
{
    usb_er_t err;
    usb_utr_t *pblf;

    /* Resend message */
    if ( USB_HSTRG_MBX == id)
    {
        err = USB_PGET_BLK(USB_HSTRG_MPL, &pblf);
    }
    if (USB_OK == err)
    {
        pblf->msginfo = mess->msginfo;
        pblf->keyword = mess->keyword;
        pblf->result = mess->result;
        pblf->complete = mess->complete;
        pblf->ip = mess->ip;
        pblf->ipp = mess->ipp;

        /* Send message */
        err = USB_SND_MSG(id, (usb_msg_t* )pblf);
        if (USB_OK != err)
        {
            USB_PRINTF1("### snd_msg error (%ld)\n", err);
            err = USB_REL_BLK(USB_HSTRG_MPL, (usb_mh_t )pblf);
            if (USB_OK != err)
            {
                USB_PRINTF1("### rel_blk error (%ld)\n", err);
            }
        }
    }
    else
    {
        USB_PRINTF1("### pget_blk error (%ld)\n", err);
    }

