miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
#else /* (BSP_CFG_RTOS_USED) */
    /* Get mem pool blk */
    if ( USB_PGET_BLK(USB_HMSC_MPL,&pblf) == USB_OK)
    {
        pblf->msginfo = USB_MSG_CLS_INIT;
        g_usb_hmsc_init_seq[ptr->ip] = USB_SEQ_0;

        pblf->ip = ptr->ip;
        pblf->ipp = ptr->ipp;

        /* Send message */
        err = USB_SND_MSG(USB_HMSC_MBX, (usb_msg_t* )pblf);
        if (USB_OK != err)
        {
            err = USB_REL_BLK(USB_HMSC_MPL, (usb_mh_t )pblf);
            USB_PRINTF0("### ClassCheck function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### ClassCheck function pget_blk error\n");
    }
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_class_check
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_read10
 Description     : Read10
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t side        : Side
                 : uint8_t  *buff       : Buffer address
                 : uint32_t secno       : Sector number
                 : uint16_t seccnt      : Sector count
                 : uint32_t trans_byte  : Trans byte
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_read10 (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t secno, uint16_t seccnt,
        uint32_t trans_byte)
{
    uint16_t hmsc_retval;

    /* set CBW parameter */
    usb_hmsc_set_rw_cbw(ptr, (uint16_t) USB_ATAPI_READ10, secno, seccnt, trans_byte, side);

    /* Data IN */
    hmsc_retval = usb_hmsc_data_in(ptr, side, buff, trans_byte);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_read10
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_write10
 Description     : Write10
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t side       : Drive number
                 : uint8_t *buff       : Buffer address
                 : uint32_t secno      : Sector number
                 : uint16_t seccnt     : Sector count
                 : uint32_t trans_byte : Trans byte
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_write10 (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t secno, uint16_t seccnt,
        uint32_t trans_byte)
{
    uint16_t hmsc_retval;

    /* set CBW parameter */
    usb_hmsc_set_rw_cbw(ptr, (uint16_t) USB_ATAPI_WRITE10, secno, seccnt, trans_byte, side);

    /* Data OUT */
    hmsc_retval = usb_hmsc_data_out(ptr, side, buff, trans_byte);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_write10
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hmsc_test_unit
 Description     : TestUnit
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Drive number
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_test_unit (usb_utr_t *ptr, uint16_t side)
{
    uint8_t cbwcb[12];
    uint16_t hmsc_retval;

    /* Data clear */
    usb_hmsc_clr_data((uint16_t) 12, cbwcb);

    /* Data set */
    /* Command */
    cbwcb[0] = USB_ATAPI_TEST_UNIT_READY;

    /* Set CBW parameter */
    usb_hmsc_set_els_cbw(ptr, (uint8_t*) &cbwcb, (uint32_t) 0, side);

    /* No Data */
    hmsc_retval = usb_hmsc_no_data(ptr, side);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_test_unit
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hmsc_request_sense
 Description     : RequestSense
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Drive number
                 : uint8_t      *buff   : Pointer to the buffer area
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_request_sense (usb_utr_t *ptr, uint16_t side, uint8_t *buff)
{
    uint8_t cbwcb[12];
    uint8_t length = 18;
    uint16_t hmsc_retval;

    /* Data clear */
    usb_hmsc_clr_data((uint16_t) 12, cbwcb);

    /* Data set */
    /* Command */
    cbwcb[0] = USB_ATAPI_REQUEST_SENSE;

    /* Allocation length */
    cbwcb[4] = length;

    /* Set CBW parameter */
    usb_hmsc_set_els_cbw(ptr, (uint8_t*) &cbwcb, (uint32_t) length, side);

    /* Data IN */
    hmsc_retval = usb_hmsc_data_in(ptr, side, buff, (uint32_t) length);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_request_sense
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_inquiry
 Description     : Inquiry
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Drive number
                 : uint8_t      *buff   : Pointer to the buffer area
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_inquiry (usb_utr_t *ptr, uint16_t side, uint8_t *buff)
{
    uint8_t cbwcb[12];
    uint8_t length = 36;
    uint16_t hmsc_retval;

    /* Data clear */
    usb_hmsc_clr_data((uint16_t) 12, cbwcb);

    /* Data set */
    /* Command */
    cbwcb[0] = USB_ATAPI_INQUIRY;

    /* Allocation length */
    cbwcb[4] = length;

    /* Set CBW parameter */
    usb_hmsc_set_els_cbw(ptr, (uint8_t*) &cbwcb, (uint32_t) length, side);

    /* Data IN */
    hmsc_retval = usb_hmsc_data_in(ptr, side, buff, (uint32_t) length);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_inquiry
 ******************************************************************************/

