miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_read_capacity
 Description     : ReadCapacity
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Drive number
                 : uint8_t      *buff   : Pointer to the buffer area
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_read_capacity (usb_utr_t *ptr, uint16_t side, uint8_t *buff)
{
    uint8_t cbwcb[12];
    uint8_t length = 8;
    uint16_t hmsc_retval;

    /* Data clear */
    usb_hmsc_clr_data((uint16_t) 12, cbwcb);

    /* Data set */
    /* Command */
    cbwcb[0] = USB_ATAPI_READ_CAPACITY;

    /* Set CBW parameter */
    usb_hmsc_set_els_cbw(ptr, (uint8_t*) &cbwcb, (uint32_t) length, side);

    /* Data IN */
    hmsc_retval = usb_hmsc_data_in(ptr, side, buff, (uint32_t) length);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_read_capacity
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_read_format_capacity
 Description     : ReadFormatCapacity
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Drive number
                 : uint8_t      *buff   : Pointer to the buffer area
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_read_format_capacity (usb_utr_t *ptr, uint16_t side, uint8_t *buff)
{
    uint8_t cbwcb[12];
    uint8_t length = 0x20;
    uint16_t hmsc_retval;

    /* Data clear */
    usb_hmsc_clr_data((uint16_t) 12, cbwcb);

    /* Data set */
    /* Command */
    cbwcb[0] = USB_ATAPI_READ_FORMAT_CAPACITY;

    /* Allocation length */
    cbwcb[8] = length;

    /* Set CBW parameter */
    usb_hmsc_set_els_cbw(ptr, (uint8_t*) &cbwcb, (uint32_t) length, side);

    /* Data IN */
    hmsc_retval = usb_hmsc_data_in(ptr, side, buff, (uint32_t) length);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_read_format_capacity
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_get_max_unit
 Description     : Get Max LUN request
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     addr    : Device address
                 : uint8_t      *buff   : Pointer to the buffer area
                 : usb_cb_t     complete: CallBack Function
 Return value    : usb_er_t                  : Error Code
 ******************************************************************************/
usb_er_t usb_hmsc_get_max_unit (usb_utr_t *ptr, uint16_t addr, uint8_t *buff, usb_cb_t complete)
{
    usb_er_t err;
    static usb_ctrl_trans_t get_max_lun_table;
#if (BSP_CFG_RTOS_USED)
    uint16_t hmsc_retval;
#endif /* (BSP_CFG_RTOS_USED) */

    get_max_lun_table.setup.type = 0xFEA1;
    get_max_lun_table.setup.value = 0x0000;
    get_max_lun_table.setup.index = 0x0000;
    get_max_lun_table.setup.length = 0x0001;
    get_max_lun_table.address = addr;

    /* Recieve MaxLUN */
    g_usb_hmsc_class_control[ptr->ip].keyword = USB_PIPE0;
    g_usb_hmsc_class_control[ptr->ip].p_tranadr = buff;
    g_usb_hmsc_class_control[ptr->ip].tranlen = get_max_lun_table.setup.length;
    g_usb_hmsc_class_control[ptr->ip].p_setup = (uint16_t *) &get_max_lun_table;
    g_usb_hmsc_class_control[ptr->ip].complete = complete;
    g_usb_hmsc_class_control[ptr->ip].segment = USB_TRAN_END;
    g_usb_hmsc_class_control[ptr->ip].ip = ptr->ip;
    g_usb_hmsc_class_control[ptr->ip].ipp = ptr->ipp;

#if (BSP_CFG_RTOS_USED)
    while (1)
    {
        err = usb_hstd_transfer_start_req(&g_usb_hmsc_class_control[ptr->ip]);
        if (USB_QOVR != err)
        {
            break; /* Control Transfer not overlaps */
        }

        /* Control Transfer overlaps. Should retry */
        usb_cpu_delay_xms((uint16_t)1);
    }

    hmsc_retval = usb_hmsc_trans_wait_tmo((uint16_t)3000);
    if (USB_DATA_STALL == hmsc_retval)
    {
        USB_PRINTF0("### GetMaxUnit not support !\n");
        return USB_ERROR;
    }
    else if (USB_DATA_TMO == hmsc_retval)
    {
        USB_PRINTF0("### GetMaxUnit not support(time out) !\n");
        usb_hstd_transfer_end(ptr, USB_PIPE0, hmsc_retval);
        return USB_ERROR;
    }
    else if (USB_CTRL_END != hmsc_retval)
    {
        USB_PRINTF0("### GetMaxUnit error\n");
        return USB_ERROR;
    }
    else
    {
        return USB_OK;
    }
#else /* (BSP_CFG_RTOS_USED) */
    err = usb_hstd_transfer_start(&g_usb_hmsc_class_control[ptr->ip]);
    return err;
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_get_max_unit
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_mass_storage_reset
 Description     : Mass Strage Reset request
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     addr    : Device address
                 : usb_cb_t     complete: CallBack Function
 Return value    : usb_er_t                 : Error Code
 ******************************************************************************/
usb_er_t usb_hmsc_mass_storage_reset (usb_utr_t *ptr, uint16_t addr, usb_cb_t complete)
{
    usb_er_t err;
#if (BSP_CFG_RTOS_USED)
    uint16_t hmsc_retval;
#endif /* (BSP_CFG_RTOS_USED) */

    static usb_ctrl_trans_t mass_storage_reset_table;

    mass_storage_reset_table.setup.type = 0xFF21;
    mass_storage_reset_table.setup.value = 0x0000;
    mass_storage_reset_table.setup.index = 0x0000;
    mass_storage_reset_table.setup.length = 0x0000;
    mass_storage_reset_table.address = addr;

    /* Set MassStorageReset */
    g_usb_hmsc_class_control[ptr->ip].keyword = USB_PIPE0;
    g_usb_hmsc_class_control[ptr->ip].p_tranadr = USB_NULL;
    g_usb_hmsc_class_control[ptr->ip].tranlen = mass_storage_reset_table.setup.length;
    g_usb_hmsc_class_control[ptr->ip].p_setup = (uint16_t *) &mass_storage_reset_table;
    g_usb_hmsc_class_control[ptr->ip].complete = complete;
    g_usb_hmsc_class_control[ptr->ip].segment = USB_TRAN_END;
    g_usb_hmsc_class_control[ptr->ip].ip = ptr->ip;
    g_usb_hmsc_class_control[ptr->ip].ipp = ptr->ipp;

#if (BSP_CFG_RTOS_USED)
    while (1)
    {
        err = usb_hstd_transfer_start(&g_usb_hmsc_class_control[ptr->ip]);
        if (USB_QOVR != err)
        {
            break; /* Control Transfer not overlaps */
        }

        /* Control Transfer overlaps. Should retry */
        usb_cpu_delay_xms((uint16_t)1);
    }

