miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
    hmsc_retval = usb_hmsc_trans_wait_tmo((uint16_t)3000);
    if (USB_DATA_STALL == hmsc_retval)
    {
        USB_PRINTF0("*** MassStorageReset not support !\n");
        return USB_ERROR;
    }
    else if (USB_DATA_TMO == hmsc_retval)
    {
        USB_PRINTF0("*** MassStorageReset not support(time out) !\n");
        usb_hstd_transfer_end(ptr, USB_PIPE0, hmsc_retval);
        return USB_ERROR;
    }
    else if (USB_CTRL_END != hmsc_retval)
    {
        USB_PRINTF1("### MassStorageReset control transfer error(%d) !\n", hmsc_retval);
        return USB_ERROR;
    }
    else
    {
        return USB_OK;
    }
#else /* (BSP_CFG_RTOS_USED) */
    err = usb_hstd_transfer_start(&g_usb_hmsc_class_control[ptr->ip]);
    return err;
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_mass_storage_reset
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_prevent_allow
 Description     : PreventAllow
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Drive number
                 : uint8_t      *buff   : Pointer to the buffer area
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_prevent_allow (usb_utr_t *ptr, uint16_t side, uint8_t *buff)
{
    uint8_t cbwcb[12];
    uint16_t hmsc_retval;

    /* Data clear */
    usb_hmsc_clr_data((uint16_t) 12, cbwcb);

    /* Data set */
    /* Command */
    cbwcb[0] = USB_ATAPI_PREVENT_ALLOW;

    /* Reserved */
    cbwcb[4] = buff[0];

    /* Set CBW parameter */
    usb_hmsc_set_els_cbw(ptr, (uint8_t*) &cbwcb, (uint32_t) 0, side);

    /* No Data */
    hmsc_retval = usb_hmsc_no_data(ptr, side);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_prevent_allow
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_mode_sense10
 Description     : ModeSense10
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Drive number
                 : uint8_t      *buff   : [OUT]Pointer to the buffer area/[IN]buff[0] Page Code
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_mode_sense10 (usb_utr_t *ptr, uint16_t side, uint8_t *buff)
{
    uint8_t cbwcb[12];
    uint8_t length;
    uint16_t hmsc_retval;

    /* Data clear */
    usb_hmsc_clr_data((uint16_t) 12, cbwcb);

    /* Data set */
    /* Command */
    cbwcb[0] = USB_ATAPI_MODE_SENSE10;

    /* Set LUN / DBD=1 */
    /* b7-b5:LUN (=0),b4-b0:Reserved */
    cbwcb[1] = 0x00;

    /* b7-b6:PageControl = Current values(=0),b5-b0:PageCode */
    cbwcb[2] = buff[0];

    switch (buff[0])    /* [IN]buff[0] Page Code */
    {
        case 0x01:  /* Read-Write Error Recovery Page */
        case 0x08:  /* Caching Page */
        case 0x1B:  /* Removable Block Access Capacities Page */
            length = 20;    /* 8 + 12 */
        break;
        case 0x1C:  /* Timer & Protect Page */
            length = 16;    /* 8 + 8 */
        break;
        case 0x3F:  /* Return all pages(valid only for MODE SENSE command) */
            length = 44;    /* 8 + 12 + 12 +12 */
        break;
        default:
            return USB_PAR;
        break;
    }

    /* Allocation length */
    cbwcb[7] = 0x00;    /* MSB */
    cbwcb[8] = length;  /* LSB */

    /* Set CBW parameter */
    usb_hmsc_set_els_cbw(ptr, (uint8_t*) &cbwcb, (uint32_t) length, side);

    /* Data IN */
    hmsc_retval = usb_hmsc_data_in(ptr, side, buff, (uint32_t) length);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_mode_sense10
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hmsc_mode_select10
 Description     : ModeSelect6
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Drive number
                 : uint8_t      *buff   : Pointer to the buffer area
                 :              buff[0]-[7]:Mode Parameter Header
                 :              buff[8]-[n]:Page(s)
                 :               buff[8] b7:Parameter Savable(PS)
                 :               buff[8] b6:Reserved
                 :               buff[8] b5-b0:Page Code
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_mode_select10 (usb_utr_t *ptr, uint16_t side, uint8_t *buff)
{
    uint8_t cbwcb[12];
    uint8_t length = 18;
    uint16_t hmsc_retval;

    /* Data clear */
    usb_hmsc_clr_data((uint16_t) 12, cbwcb);

    /* Data set */
    /* Command */
    cbwcb[0] = USB_ATAPI_MODE_SELECT10;

    /* Logical Unit Number = 0/ Save Pages(SP) = 0 */
    cbwcb[1] = 0x10;

    switch ((buff[8] & 0x3f))
    {
        case 0x01:  /* Read-Write Error Recovery Page */
        case 0x08:  /* Caching Page */
        case 0x1B:  /* Removable Block Access Capacities Page */
            length = 20;    /* 8 + 12 */
        break;
        case 0x1C:  /* Timer & Protect Page */
            length = 16;    /* 8 + 8 */
        break;
        default:
            return USB_PAR;
        break;
    }

    /* Parameter list length */
    cbwcb[7] = 0x00;    /* MSB */
    cbwcb[8] = length;  /* LSB */

    /* Set CBW parameter */
    usb_hmsc_set_els_cbw(ptr, (uint8_t*) &cbwcb, (uint32_t) length, side);

    /* Data OUT */
    hmsc_retval = usb_hmsc_data_out(ptr, side, buff, (uint32_t) length);
    return (hmsc_retval);
}
/******************************************************************************
 End of function usb_hmsc_mode_select10
 ******************************************************************************/

