miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_get_dev_sts
 Description     : Responds to HMSCD operation state
 Arugments       : uint16_t     side    : Drive number
 Return value    : uint16_t :
 ******************************************************************************/
uint16_t usb_hmsc_get_dev_sts (uint16_t side)
{
    return (g_usb_hmsc_drvno_tbl[side].use_flag);
}
/******************************************************************************
 End of function usb_hmsc_get_dev_sts
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_alloc_drvno
 Description     : Alloc Drive no.
 Arguments       : uint16_t devadr       : Device address
 Return value    : Drive no.
 ******************************************************************************/
uint16_t usb_hmsc_alloc_drvno (uint16_t devadr)
{
    uint16_t side;
    uint16_t ipno;

    if (USBA_ADDRESS_OFFSET == (devadr & USB_IP_MASK))
    {
        ipno = USB_IP1;
    }
    else
    {
        ipno = USB_IP0;
    }
    devadr &= USB_ADDRESS_MASK;

    for (side = 0; side < USB_MAXSTRAGE; side++)
    {
        if ( USB_NOUSE == g_usb_hmsc_drvno_tbl[side].use_flag)
        {
            g_usb_hmsc_drvno_tbl[side].use_flag = USB_TRUE;
            g_usb_hmsc_drvno_tbl[side].devadr = devadr;
            g_usb_hmsc_drvno_tbl[side].ip = ipno;
            return side;
        }
    }

    USB_PRINTF0("DRIVE ALLOC ERROR");
    return USB_ERROR;
}
/******************************************************************************
 End of function usb_hmsc_alloc_drvno
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_free_drvno
 Description     : Release Drive no.
 Arugments       : uint16_t     side    : Drive number
 Return value    : result
 ******************************************************************************/
uint16_t usb_hmsc_free_drvno (uint16_t side)
{
    if (side > USB_MAXSTRAGE)
    {
        return USB_ERROR;
    }

    g_usb_hmsc_drvno_tbl[side].use_flag = USB_NOUSE;
    g_usb_hmsc_drvno_tbl[side].ip = USB_NOUSE;
    g_usb_hmsc_drvno_tbl[side].devadr = USB_NOUSE;
    return USB_OK;
}
/******************************************************************************
 End of function usb_hmsc_free_drvno
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_ref_drvno
 Description     : Get Drive no.
 Arguments       : uint16_t devadr       : Device address
 Return value    : Drive no.
 ******************************************************************************/
uint16_t usb_hmsc_ref_drvno (uint16_t devadr)
{
    uint16_t side;
    uint16_t ipno;

    if ((devadr & USB_IP_MASK) == USBA_ADDRESS_OFFSET)
    {
        ipno = USB_IP1;
    }
    else
    {
        ipno = USB_IP0;
    }
    devadr &= USB_ADDRESS_MASK;

    for (side = 0; side < USB_MAXSTRAGE; side++)
    {
        if ((devadr == g_usb_hmsc_drvno_tbl[side].devadr) && (ipno == g_usb_hmsc_drvno_tbl[side].ip))
        {
            return side;
        }
    }
    return USB_ERROR;
}
/******************************************************************************
 End of function usb_hmsc_ref_drvno
 ******************************************************************************//******************************************************************************
 End  Of File
 ******************************************************************************/
